MPS/src/Catalogs/ТочкиСценарияСтарт/ТочкиСценарияСтарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТочкиСценарияСтарт</name>
  <owners>Catalog.Сценарии</owners>
  <attributes>
    <name>ЗапускПоРасписанию</name>
    <comment>Флаг запуска по расписанию, иначе - по действию</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействиеЗапуска</name>
    <type>
      <types>CatalogRef.ВидыДействийКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьЛимитСрабатыванияНаКлиенте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛимитСрабатыванияНаКлиенте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЧастотыЗапускаСценарияНаКлиенте</name>
    <type>
      <types>EnumRef.ЧастотаЗапускаСценарияНаКлиенте</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодЗапускаСценарияНаКлиенте</name>
    <type>
      <types>EnumRef.ПериодыДействий</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧастотаЗапуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегламентноеЗаданиеGUID</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыДействий</name>
    <comment>Множественные параметры действий</comment>
    <attributes>
      <name>ДействиеЗапуска</name>
      <type>
        <types>CatalogRef.ВидыДействийКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаПараметров</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметра</name>
      <type>
        <types>CatalogRef.СпискиПродуктов</types>
        <types>CatalogRef.ВидыДействийКлиента</types>
        <types>String</types>
        <types>CatalogRef.СегментыНоменклатуры</types>
        <types>CatalogRef.СегментыПартнеров</types>
        <types>CatalogRef.МассовыеРассылки</types>
        <types>CatalogRef.ТоварныеКатегории</types>
        <types>CatalogRef.АвтоматическиеРассылки</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыПромокодовПриРасписании</name>
    <comment>Условие выполнения расписания: Наборы, из которых доступна выдача промокода</comment>
    <attributes>
      <name>НаборПромокодов</name>
      <type>
        <types>CatalogRef.НаборыПромокодов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаличиеПродуктовВСегментеПриРасписании</name>
    <comment>Условие выполнения расписания: наличие продуктов</comment>
    <attributes>
      <name>Сегмент</name>
      <type>
        <types>CatalogRef.СегментыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

MPS/src/Enums/ЧастотаЗапускаСценарияНаКлиенте/ЧастотаЗапускаСценарияНаКлиенте.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЧастотаЗапускаСценарияНаКлиенте</name>
  <enumValues>
    <name>КаждыйРаз</name>
  </enumValues>
  <enumValues>
    <name>ОдинРаз</name>
  </enumValues>
  <enumValues>
    <name>ОдинРазЗаПериод</name>
  </enumValues>
</mdclass:Enum>

MPS/src/Catalogs/ТочкиСценарияСтарт/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	КомпоновкаИРасписание_ПКМП.ОбъектОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметровЗадания = КомпоновкаИРасписание_ПКМП.СтруктураПараметровЗадания();
	СтруктураПараметровЗадания.ВидРегламентногоЗадания = "СтартСценарияПоРасписанию";
	СтруктураПараметровЗадания.НаименованиеЗадания = "Старт сценария " + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "Наименование") ;
	КомпоновкаИРасписание_ПКМП.ОбъектПередЗаписью(ЭтотОбъект, СтруктураПараметровЗадания, Отказ);

	Если не ЗапускПоРасписанию и ЗначениеЗаполнено(РегламентноеЗаданиеGUID) Тогда
		КомпоновкаИРасписание_ПКМП.ОбъектПередУдалением(ЭтотОбъект);
	КонецЕсли;	
		
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	КомпоновкаИРасписание_ПКМП.ОбъектПередУдалением(ЭтотОбъект, ,Отказ);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	КомпоновкаИРасписание_ПКМП.ОбъектПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	КомпоновкаИРасписание_ПКМП.ОбъектПриКопировании(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗапускПоРасписанию Тогда 
		ПроверяемыеРеквизиты.Добавить("РегламентноеЗаданиеGUID");
	Иначе
		ПроверяемыеРеквизиты.Добавить("ДействиеЗапуска");
		Если не ВидЧастотыЗапускаСценарияНаКлиенте = Перечисления.ЧастотаЗапускаСценарияНаКлиенте.ОдинРаз и ЕстьЛимитСрабатыванияНаКлиенте Тогда
			ПроверяемыеРеквизиты.Добавить("ЛимитСрабатыванияНаКлиенте");
		КонецЕсли;	
		Если ВидЧастотыЗапускаСценарияНаКлиенте = Перечисления.ЧастотаЗапускаСценарияНаКлиенте.ОдинРазЗаПериод Тогда
			ПроверяемыеРеквизиты.Добавить("ПериодЗапускаСценарияНаКлиенте");
			ПроверяемыеРеквизиты.Добавить("ЧастотаЗапуска");
		КонецЕсли;	
	КонецЕсли;		
	
	Ошибки = Неопределено;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки,  Отказ);
	
КонецПроцедуры

#КонецЕсли
